Revit 2024 API
FileDialog Class
 Base class supporting display of the dialog used to navigate to and select a file from Autodesk Revit.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class FileDialog : IDisposable
Visual Basic
Public Class FileDialog _
	Implements IDisposable
Visual C++
public ref class FileDialog : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.FileDialog
 Autodesk.Revit.UI.FileOpenDialog
 Autodesk.Revit.UI.FileSaveDialog
See Also
FileDialog Members
Autodesk.Revit.UI Namespace